Контролируемые счета/example/9_PreBlockCreate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <ns6:UCBRUHeaders xmlns:ns6="urn:ucbru:gbo:v4" xmlns:ns5="urn:ucbru:gbo:v4:casa">
            <ns6:Correlation>
                <ns6:XRef>555558ba-f324-3333-bff0-fd9745600395</ns6:XRef>
            </ns6:Correlation>
            <ns6:Audit>
                <ns6:MessagePath>
                    <ns6:Step>
                        <ns6:Application.Module>PAYMENT_HUB</ns6:Application.Module>
                        <ns6:TimeStamp>2016-11-28T11:59:04.644Z</ns6:TimeStamp>
                    </ns6:Step>
                </ns6:MessagePath>
                <ns6:ProcessInfo>
                    <ns6:Name>PAYMENT_HUB</ns6:Name>
                    <ns6:InstanceId>55555-888-223-124-8799</ns6:InstanceId>
                </ns6:ProcessInfo>
            </ns6:Audit>
        </ns6:UCBRUHeaders>
    </soapenv:Header>
    <soapenv:Body>
        <SCASABlockAmountPreBlockCreate xmlns="urn:ucbru:gbo:v4:casa" xmlns:ns2="urn:ucbru:gbo:v4">
            <Block>
                <RequestNumber>1</RequestNumber>
                <BlockReference>
                    <SystemCode>PHUB</SystemCode>
                    <BlockId>555002</BlockId>
                </BlockReference>
                <CBAccount>30232810200014724287</CBAccount>
                <BlockAmount>15222</BlockAmount>
                <ObjectReference>555111</ObjectReference>
                <ExtModule>PHub1</ExtModule>
                <ExtOperationCode>PAY</ExtOperationCode>
                <Priority>5</Priority>
                <OperationTimestamp>2016-01-25T03:43:59Z</OperationTimestamp>
                <Narrative>оепебнд опхмършу демефмшу япедярб янцкюямн пееярпнб нр 20150625 он днцнбнпс на хрб нр 27.07.2012. мдя ме накюцюеряъ</Narrative>
                <UseOverdraft>true</UseOverdraft>
            </Block>
        </SCASABlockAmountPreBlockCreate>
    </soapenv:Body>
</soapenv:Envelope>
